#include <Arduino.h>

// Визначаємо цифровий пін, до якого підключимо зовнішній світлодіод.
// Суфікс _OUT одразу підказує, що цей пін працює на вихід.
#define LED_OUT 15

void setup() {
    // Налаштовуємо пін як вихід (OUTPUT), щоб контролер міг подавати на нього напругу
    pinMode(LED_OUT, OUTPUT);
}

void loop() {
    digitalWrite(LED_OUT, HIGH); // Вмикаємо світлодіод (подаємо 3.3 В)
    delay(1000);                 // Чекаємо 1 секунду (1000 мілісекунд)
    
    digitalWrite(LED_OUT, LOW);  // Вимикаємо світлодіод (подаємо 0 В)
    delay(1000);                 // Чекаємо 1 секунду
}